# Вывести на экран числа от -N до N
N = int(input("Введите число: "))
numbers = list(range(-N, N+1))
print(numbers)
